[
  {
    "path": "articles/sketches/",
    "title": "Sketches",
    "description": "Project rationale, goals, and target scenarios.",
    "author": [
      {
        "name": "Taren Sanders",
        "url": "https://github.com/tarensanders"
      }
    ],
    "date": "2022-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nScenarios\r\nThere are two groups of users we think might want to access the\r\nsystem. Example use cases are given below.\r\nScenario One\r\nUsers: Parents\r\n\r\nA parent wants to explore the types of exposure. The select a\r\nparticular exposure (e.g., TV) might impact their child. They search for\r\nthe exposure and are given an overview of the known outcome categories.\r\nVisualise info about the uncertainty for each effect. They filter the\r\nresults for their child’s age. They click into an outcome category to\r\nget more information on the result (e.g., text summary, info about\r\nreason for the uncertainty).\r\n\r\nScenario Two\r\nUsers: Researchers/clinicians\r\n\r\nA domain expert wants to explore evidence for screen time in more\r\ndetail. Use the system to get an overview of the evidence (exposure,\r\noutcome, effect size). They search for the exposure and/or the outcome,\r\nand optionally filter by age. They click into a relationship and can\r\naccess the forest plot of the original studies, and the link to the\r\noriginal meta-analysis (and other, related studies, uncertainty). Three\r\nlevels: evidence, uncertainty, meta-data.\r\n\r\nTasks/Screens\r\nTask One\r\n\r\nExplore the exposures that there are evidence for.\r\n\r\nProposed Idiom: Heatmap\r\nCounts\r\n\r\n\r\n\r\nEffect sizes\r\n\r\n\r\n\r\nSide-by-side\r\n\r\n\r\n\r\nNotes\r\nCould show these side-by-side\r\nCould further reduce the number of categories (e.g., to just\r\n“Health”, “Education”, etc)\r\nAt the moment the effect size is just taking the mean, but I think\r\nit would be more sensible to rerun the meta-analysis\r\nThe proposed interaction (to move to more detailed screen) would be\r\nto click one of:\r\nExposure(y - axis label)\r\nOutcome(x - axis label)\r\nEffect size (cell of heatmap)\r\n\r\nTask Two\r\n\r\nExplore an overview of the outcome categories for the selected\r\nexposure category.\r\n\r\n(E.g., if they have chosen ‘video games’)\r\nOption One (Heatmap)\r\n\r\n\r\n\r\nOption Two (Line Range)\r\n\r\n\r\n\r\nNotes\r\nI think the heatmap is likely to be more intuitive\r\nWe could instead put the line range in the tooltip or in the next\r\nscreen\r\nThe proposed interaction would be hover and click in for\r\ndetails\r\nStudy quality could also be in the tooltip\r\nTask Three\r\n\r\nShow detailed information about the effect\r\n\r\nTODO - I think this will likely be a formatted page with an\r\ninterpretation, plus original forest plot and links to studies for\r\n‘expert’ users.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-22T14:58:40+10:00",
    "input_file": {}
  },
  {
    "path": "articles/rationale/",
    "title": "Rationale",
    "description": "Project rationale, goals, and target scenarios.",
    "author": [
      {
        "name": "Taren Sanders",
        "url": "https://github.com/tarensanders"
      }
    ],
    "date": "2022-05-19",
    "categories": [],
    "contents": "\r\nIntroduction\r\nScreen time is a complex\r\nissue\r\nChildren’s engagement in excessive screen time is the number one\r\nconcern Australian parents have about their children’s health and\r\nbehaviour, ahead of nutrition, bullying, and physical inactivity (Rhodes 2015).\r\nHowever, screen time is a complex issue. While some forms of screen use\r\n(e.g., television viewing) may be detrimental to health and well-being\r\n(Hale and Guan\r\n2015; Sweetser et al. 2012), evidence for\r\nother forms of screen exposure (e.g., video games or online\r\ncommunication, such as Zoom) remains less certain and, in some cases,\r\nmay even be beneficial (Li and\r\nAtkins 2004; Warburton and Highfield 2017). Further\r\nconfusing the issue is that screen time guidelines (e.g.,\r\nAustralian Government 2021; World\r\nHealth Organization 2019) typically focus on only the\r\nduration of screen time, despite mounting evidence that the issue is\r\nmore nuanced and the risks might be more closely associated with the\r\ncontent and environment (Elson et\r\nal. 2019).\r\nHampering the ability for parents to make informed decision is a lack\r\nof comprehensive and contemporary evidence. Indeed, in a 2019 editorial\r\nin the leading medical journal The Lancet (The\r\nLancet 2019), the editor wrote “Our understanding of the\r\nbenefits, harms, and risks of our rapidly changing digital landscape is\r\nsorely lacking.”, and a Nature Human Behaviour editor described\r\nit as “a defining question of our age” (Nature Human Behaviour 2019). Without\r\ncomprehensive information, it is no wonder that parents are struggling\r\nto make informed decisions (Elson et\r\nal. 2019).\r\nMeta-analyses—the process of combining multiple studies together to\r\nimprove the precision of the estimated effect size (Higgins et al. 2021)—are considered the\r\nhighest form of scientific evidence (Strauss 2008). To address the lack of\r\ncomprehensive information on the risks and benefits of screen time, our\r\nteam collated and synthesised all existing meta-analytic evidence on the\r\ninfluence of screen time on children’s health, education, and well-being\r\noutcomes. We reanalysed these studies to ensure the effect sizes were\r\ncomparable, giving us a set of almost 200 effect sizes. However, while\r\nwe now have a comprehensive set of information, communicating this\r\ninformation to parents is still a challenge.\r\nCommunicating science is\r\nhard\r\nFor people to make informed decisions, they need to understand the\r\nbenefits, risks, and other costs of their decision (Fischhoff 2013). But, communicating\r\ninformation in such a way that allows people to make these decisions is\r\nchallenging. According to Fischhoff (2013), good science communication can be\r\nbroken down into four tasks:\r\n\r\nTask 1. Identify the science most relevant to the\r\ndecisions that people face.\r\nTask 2. Determine what people already know.\r\nTask 3. Design communications to fill the critical\r\ngaps (between what people know and need to know).\r\nTask 4. Evaluate the adequacy of those\r\ncommunications.\r\n- Fischhoff (2013), pg. 14034\r\n\r\nAs described above, our team has already completed Task 1, and plenty\r\nof research exists regarding parents’ knowledge around screen time (i.e.,\r\nTask 2, see for example Hamilton et al. 2015). Therefore, this\r\nproject will focus on Task 3: creating a method to communicate science\r\nto fill an information gap.\r\nVisualising\r\ndata can make it easier to communicate\r\nOne way to communicate information that makes it simpler for people\r\nto make informed decisions is to visualise data (Munzner and Maguire 2015; Engebretsen\r\n2020). Data visualisation makes it simpler for people to\r\nparse the information provided, and use it to arrive at a sound\r\ndecision. There are numerous examples of this occurring. For example,\r\nThe New York Times used an interactive visualisation to show\r\nthe pros and cons of renting versus buying a house (Bostock, Carter,\r\nand Tse 2014)—a decision which can vary by a number of\r\nfactors. The website Information is beautiful used\r\nvisualisation to help people understand which treatments for COVID-19\r\nhave evidence for benefits, compared to those that do not (Information is Beautiful 2021).\r\nThe goal of this project, therefore, is to create a visualisation\r\nthat fills the information gap for parents regarding children’s screen\r\ntime behaviours.\r\nResearch Question\r\nThe research question for this project is:\r\n\r\nCan we develop a visualisation to help parents weigh the risks and\r\nbenefits of screen time on children’s health, education, and well-being\r\noutcomes?\r\n\r\nIn the process of addressing this research question, I will also\r\ninvestigate the following questions:\r\n\r\nWhat are the appropriate task abstractions to address the research\r\nquestion?\r\nWhat idioms best address the task abstractions, in order to address\r\nthe research question?\r\n\r\nMethods and Materials\r\nDataset\r\nThe dataset for this project comes from an umbrella review (also\r\nknown as a meta-meta-analysis) of the literature on screen time. To\r\nderive the dataset, we systematically searched 12 academic databases for\r\nmeta-analyses. Eligible studies were identified following screening in\r\nduplicate, and all effect sizes were extracted. If the meta-analyses\r\nprovided the original study data, these were also extracted. Where two\r\nor more meta-analyses analysed the same exposure/outcome combination, we\r\nselected the effect with the largest total sample size. Effect sizes\r\nwere converted to correlations (\\(r\\))\r\nusing appropriate formulas. We examined heterogeneity of the effect\r\nsizes using a the \\(I^2\\) measure, and\r\ntested for evidence of publication bias using Egger’s test and a test of\r\nexcess significance.\r\nThe dataset has the following features:\r\nEffect sizes with uncertainties. For each\r\nexposure/outcome combination, a correlation coefficient and confidence\r\ninterval are provided. Where possible, the effect sizes are drawn from\r\nre-analysis of the original study data, with a conversion of the\r\noriginal meta-analysis effect size used as a backup.\r\nHeterogeneity of the effect sizes. The \\(I^2\\) values measures the extent to which\r\nstudies within a meta-analysis are consistent. A high \\(I^2\\) indicates a large amount of\r\nunexplained variability in the finding (that is, the effect may not\r\noccur for all participants).\r\nStudy characteristics. Effect sizes drawn from many\r\nlarge studies will produce more precise effect estimates than a few\r\nsmall studies. The dataset includes the total sample size (\\(N\\)) and the number of studies the pooled\r\neffect is drawn from (\\(k\\)).\r\nAge group. As it is reasonable for the effect of\r\nscreen time to vary by age, the age group for each effect size is\r\nprovided.\r\nEvidence of statistical credibility. Pooled effect\r\nsizes are only as good as the studies from which they are drawn. For\r\nexample, if only positive studies are published but negative studies are\r\nnot, the pooled effect size will show a positive result where none\r\nexists (known as publication bias). The dataset includes tests for\r\npublication bias.\r\nMethodology\r\nThe methodology for this project will follow the steps outlined by\r\nMunzner and Maguire\r\n(2015). For each piece of information the\r\nusers sees, a three step process is followed:\r\nIdentify what data should be shown to the\r\nuser;\r\nIdentify why a user would be using a visualisation\r\ntool to view this data (i.e., task abstraction); and,\r\nIdentify how the data can best be displayed (i.e.,\r\nwhich idiom to use).\r\nThese series of steps can be chained together, so the output of one\r\nstep can be used as input to the next step.\r\nThere are a number of ways to approach each of these steps. One\r\napproach for determining the what and the why aspects\r\nis to consult with domain experts or stakeholders (in this case,\r\nparents). Given the contained time limit on the project, consulting with\r\nstakeholders is difficult, so I will instead rely on my own and others\r\ndomain expertise.\r\nThe initial version of the system will aim to include 3-5 task\r\nabstractions. Some possible examples of the included abstractions could\r\nbe:\r\nComparing risks and benefits for a specific outcome (e.g., video\r\ngames);\r\nIdentifying which evidence is strong and which evidence is weak;\r\nor\r\nIdentifying ways that an exposure can be modified to reduce a risk\r\n(e.g., co-viewing may decrease risks associated with television).\r\nExpected Outcome\r\nThe expected outcome for this project is a visualisation system that\r\ncan help parents make informed decisions about their children’s screen\r\ntime. Given how prevalent concerns around screen time are, ideally the\r\nsystem could be given to a third-party with greater access to parents\r\n(e.g., the Raising Children Network). Further, given the rapid rate at\r\nwhich screen time evidence accumulates, the system would ideally be\r\nrobust to constantly updated information, with little maintenance to\r\nmaintain. That is, if new evidence became available for an exposure or\r\noutcome, it could be rapidly incorporated into the visualisation\r\nsystem.\r\nEthics\r\nAs there are no research participants in this project and the dataset\r\nconsists only of pooled effect sizes, there is no requirement for Human\r\nResearch Ethics Committee approval.\r\nTimeline\r\nA timeline for this project is provided in Figure\r\n1.\r\n\r\n\r\n\r\nFigure 1: Gantt chart for the capstone project.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAustralian Government. 2021. “Physical Activity and Exercise\r\nGuidelines for All Australians.” Department of\r\nHealth.\r\n\r\n\r\nBostock, Mike, Shan Carter, and Archie Tse. 2014. “Is It Better to\r\nBuy or Rent?” The New York Times.\r\n\r\n\r\nElson, Malte, Christopher J. Ferguson, Mary Gregerson, Jerri Lynn Hogg,\r\nJames Ivory, Dana Klisanin, Patrick M. Markey, Deborah Nichols, Shahbaz\r\nSiddiqui, and June Wilson. 2019. “Do Policy Statements on Media\r\nRffects Faithfully Represent the Science?” Advances in\r\nMethods and Practices in Psychological Science 2 (1): 12–25. https://doi.org/10.1177/2515245918811301.\r\n\r\n\r\nEngebretsen, Martin. 2020. “What ‘Work’ Can Dataviz\r\nDo in Popular Science Communication?:” In Proceedings of the\r\n15th International Joint Conference on Computer\r\nVision, Imaging and Computer Graphics\r\nTheory and Applications, 260–64. https://doi.org/10.5220/0009094002600264.\r\n\r\n\r\nFischhoff, Baruch. 2013. “The Sciences of Science\r\nCommunication.” Proceedings of the National Academy of\r\nSciences 110 (Supp. 3): 14033–39. https://doi.org/10.1073/pnas.1213273110.\r\n\r\n\r\nHale, Lauren, and Stanford Guan. 2015. “Screen Time and Sleep\r\nAmong School-Aged Children and Adolescents: A Systematic\r\nLiterature Review.” Sleep Medicine Reviews 21 (June):\r\n50–58. https://doi.org/10.1016/j.smrv.2014.07.007.\r\n\r\n\r\nHamilton, Kyra, Denise Hatzis, David J. Kavanagh, and Katherine M.\r\nWhite. 2015. “Exploring Parents’ Beliefs about Their Young Child’s\r\nPhysical Activity and Screen Time Behaviours.” Journal of\r\nChild and Family Studies 24 (9): 2638–52.\r\n\r\n\r\nHiggins, Julian PT, James Thomas, Jacqueline Chandler, Miranda Cumpston,\r\nTianjing Li, Matthew James Page, and Vivian Andrea Welch, eds. 2021.\r\nCochrane Handbook for Systematic Reviews\r\nof Interventions. 6.2 ed. Cochrane.\r\n\r\n\r\nInformation is Beautiful. 2021. “COVID-19\r\n#CoronaVirus Infographic Datapack.” Information\r\nIs Beautiful.\r\nhttps://informationisbeautiful.net/visualizations/covid-19-coronavirus-infographic-datapack/.\r\n\r\n\r\nLi, Xiaoming, and Melissa S. Atkins. 2004. “Early Childhood\r\nComputer Experience and Cognitive and Motor Development.”\r\nPediatrics 113 (6): 1715–22.\r\n\r\n\r\nMunzner, Tamara, and Eamonn Maguire. 2015. Visualization\r\nAnalysis & Design.\r\n\r\n\r\nNature Human Behaviour. 2019. “Screen Time: How Much Is Too\r\nMuch?” Nature 565 (7739): 265–66. https://doi.org/10.1038/d41586-019-00137-6.\r\n\r\n\r\nRhodes, A. 2015. “Top Ten Child Health Problems: What\r\nthe Public Thinks.” The Royal Children’s Hospital\r\nMelbourne.\r\n\r\n\r\nStrauss, Sharon E., ed. 2008. Evidence-Based Medicine:\r\nHow to Practice and Teach\r\nEBM. 3rd ed. Edinburgh:\r\nElsevier/Churchill Livingstone.\r\n\r\n\r\nSweetser, Penelope, Daniel Johnson, Anne Ozdowska, and Peta Wyeth. 2012.\r\n“Active Versus Passive Screen Time for Young Children.”\r\nAustralasian Journal of Early Childhood 37 (4): 94–98. https://doi.org/10.1177/183693911203700413.\r\n\r\n\r\nThe Lancet. 2019. “Social Media, Screen Time, and Young People’s\r\nMental Health.” The Lancet 393 (10172): 611. https://doi.org/10.1016/S0140-6736(19)30358-7.\r\n\r\n\r\nWarburton, Wayne, and Kate Highfield. 2017. “Children and\r\nTechnology in a Smart Device World.” In Children,\r\nFamilies and Communities, 195–221.\r\nOxford University Press.\r\n\r\n\r\nWorld Health Organization. 2019. Guidelines on Physical Activity,\r\nSedentary Behaviour and Sleep for Children Under 5 Years of Age.\r\nPublications. World Health Organization.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-19T17:04:27+10:00",
    "input_file": {}
  }
]
